In [3]:
import numpy as np
import pandas as pd

In [9]:
df = pd.read_csv('datasets_316056_639173_amazon.csv', encoding = "ISO-8859-1", engine = 'python')

In [10]:
df.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [11]:
df.describe(include = 'all').transpose()

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
year,6454,NaN,NaN,NaN,2007.46,5.74665,1998,2002,2007,2012,2017
state,6454,23,Rio,717,NaN,NaN,NaN,NaN,NaN,NaN,NaN
month,6454,12,Janeiro,541,NaN,NaN,NaN,NaN,NaN,NaN,NaN
number,6454,NaN,NaN,NaN,108.293,190.812,0,3,24,113,998
date,6454,20,2005-01-01,324,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
#checking is there any NaN values present
df.isna().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [13]:
df.shape

(6454, 5)

In [14]:
df.replace(0, np.nan, inplace = True)

In [15]:
df.dropna(subset = ['number'], inplace = True)

In [16]:
df.shape

(5837, 5)

In [17]:
df['number']

5        10.0
7        12.0
8         4.0
12        1.0
17        1.0
18       12.0
24        1.0
26        3.0
29        5.0
31        2.0
37        2.0
38        5.0
39        1.0
42       11.0
47        3.0
49        2.0
51        1.0
54        1.0
55        2.0
56        1.0
57        2.0
62        1.0
65        1.0
66        2.0
67        1.0
72        3.0
73        2.0
74        1.0
75       19.0
76        7.0
        ...
6424    147.0
6425    104.0
6426    251.0
6427    283.0
6428    144.0
6429    179.0
6430    345.0
6431    451.0
6432    833.0
6433    623.0
6434    434.0
6435      9.0
6436     16.0
6437     20.0
6438     21.0
6439     39.0
6440    109.0
6441     96.0
6442     53.0
6443     15.0
6444     13.0
6445      7.0
6446     46.0
6447     72.0
6448    105.0
6449    128.0
6450     85.0
6451    223.0
6452    373.0
6453    119.0
Name: number, Length: 5837, dtype: float64

In [18]:
df['state'].nunique()

23

In [19]:
df.groupby('state').sum().sort_values('number')

                     year     number
state
Sergipe            313318   3237.000
Distrito Federal   305259   3561.000
Alagoas            391559   4644.000
Espirito Santo     453756   6546.000
Acre               343430  18464.030
Rondonia           453778  20285.429
Amapa              333392  21831.576
Santa Catarina     455796  24359.852
Roraima            431718  24385.074
Pernambuco         453746  24498.000
Pará               459770  24512.144
Maranhao           467792  25129.131
Ceara              445715  30428.063
Amazonas           457767  30650.129
Tocantins          465792  33707.885
Minas Gerais       469793  37475.258
Goias              469793  37695.520
Piau               465786  37803.747
Bahia              469793  44746.226
Rio               1327182  45160.865
Sao Paulo          469793  51121.198
Paraiba            875418  52435.918
Mato Grosso        939586  96246.028

In [13]:
##!jupyter nbconvert --to script config_template.ipynb

In [15]:
import matplotlib.pyplot as plt

In [2]:
plt.bar(
df['month'],
df['number'], 
color = (0.5,0.1,0.5,0.6))

NameError: name 'plt' is not defined

In [5]:
data = [['Janeiro',  'Jan'], ['Fevereiro',  'Feb'],['Março',  'Mar'],
['Abril',  'Apr'], ['Maio',  'May'],['Junho',  'Jun'], ['Julho',  'Jul'], ['Agosto',  'Aug'],
['Setembro',  'Sep'], ['Outubro',  'Oct'], ['Novembro',  'Nov'], ['Dezembro',  'Dec']]

In [7]:
lookup_df = pd.DataFrame(data, columns = ['Original Name', 'Lookup Value'])

In [20]:
lookup_df

   Original Name Lookup Value
0        Janeiro          Jan
1      Fevereiro          Feb
2          Março          Mar
3          Abril          Apr
4           Maio          May
5          Junho          Jun
6          Julho          Jul
7         Agosto          Aug
8       Setembro          Sep
9        Outubro          Oct
10      Novembro          Nov
11      Dezembro          Dec

In [21]:
df['month'] = df['month'].map(lookup_df.set_index('Original Name')['Lookup Value'])

In [22]:
df.head()

    year state month  number        date
5   2003  Acre   Jan    10.0  2003-01-01
7   2005  Acre   Jan    12.0  2005-01-01
8   2006  Acre   Jan     4.0  2006-01-01
12  2010  Acre   Jan     1.0  2010-01-01
17  2015  Acre   Jan     1.0  2015-01-01